[A_heal_immunity H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法免疫"
mTooltip="该生物无法成为任何魔法学派负面法术或效果的目标。来自敌方攻击的所有魔法伤害减半。"

[Anti_heal.A_IceStrike_Buff H7BaseBuff]
mName="疗愈冻结"
mTooltip="该生物无法再接受治疗或自我疗愈。持续 %durnow 回合。(对 "构造体" 类型单位无效)"

[Anti_heal.A_Nova H7HeroAbility]
mTooltipMagicGuild="目标生物无法再接受治疗或被疗愈。(对构造体类型单位无效)"
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="疗愈冻结"
mTooltip="造成 %d %icon_water 伤害。生物无法再被疗愈。持续 %buff1.buff.durini 回合。对构造体类型单位无效。"

[Armure_de_givre.A_armure_givre_Buff H7BaseBuff]
mName="寒冰护甲"
mTooltip="持续 %durnow 回合。该生物获得 %stat1 %icon_defense 防御增益，并冻结所有近战攻击它的敌人。"

[Armure_de_givre.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="增加目标盟友的防御并冻结所有近战攻击者"
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="在4X4区域内将目标盟友的防御增加 %buff1.buff.stat1 %icon_defense，并在 %buff1.buff.durini 回合内冻结所有近战攻击他的敌人"
mName="寒冰护甲"
mTooltip="将目标盟友的防御增加 %buff1.buff.stat1，并在 %buff1.buff.durini 回合内冻结所有近战攻击他的敌人"

[Ice_lance.A_Nova H7HeroAbility]
mTooltipMagicGuild="对打击线上的所有单位造成 %d.icon 水系伤害，随后有30%的几率冻结它们。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded="对打击区域内的单位造成 %d.min ‡ %d.max %d.icon 水系伤害，并有60%的几率冻结它们。"
mName="冰枪术"
mTooltip="对打击区域内的单位造成 %d.min ‡ %d.max %d.icon 水系伤害，并有30%的几率冻结它们。"